In [104]:
import numpy as np
import pandas as pd

In [124]:

dat = [{"name": np.nan, "age": 17, "email": "contact@irfans.dev"},
       {"name": "Naira", "age": 7, "email": "naira@irfans.dev"},
       {"name": "Nusaiba", "age": 7, "email": "naira@irfans.dev"},
       {"name": "Naira", "age": 7, "email": "naira@irfans.dev"}]

new_dat = pd.DataFrame(dat)
new_dat

      name  age               email
0      NaN   17  contact@irfans.dev
1    Naira    7    naira@irfans.dev
2  Nusaiba    7    naira@irfans.dev
3    Naira    7    naira@irfans.dev

In [ ]:
for index, column in new_dat.iterrows():
  print(column[0])

In [ ]:
for column in new_dat.itertuples():
  print(type(column[1]))

In [ ]:
new_dat["name"].mode()[0]

new_dat["name"] = new_dat["name"].fillna("Naira")

In [107]:
new_dat

      name  age               email
0      NaN   17  contact@irfans.dev
1    Naira    7    naira@irfans.dev
2  Nusaiba    7    naira@irfans.dev
3    Naira    7    naira@irfans.dev

In [ ]:
print(type(new_dat.info()))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     4 non-null      int64
 2   email   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
<class 'NoneType'>

In [116]:
new_dat["age"].mean()

np.float64(9.5)

In [123]:
# dataset.select_dtypes(include="float64")
new_dat.select_dtypes(include="int64")

   age
0   17
1    7
2    7
3    7

In [128]:
for i in new_dat.columns:
    print(f"Column '{i}' has dtype: {new_dat[i].dtype}")

Column 'name' has dtype: object
Column 'age' has dtype: int64
Column 'email' has dtype: object